# ---------- GIORGI BERIDZE ----------
# Lesson 8 home tasks

"""1. დაწერეთ ფუნქცია, რომელიც პარამეტრად იღებს ლისტს და გადაყავს ეს ლისტი ტუპლში
2. დაწერეთ ფუნქცია, რომელიც პარამეტრად იღებს ტუპლს და გადაყავს ეს ტუპლი ლისტში
3. დაწერეთ ფუნქცია, რომელიც პარამეტრად იღებს დიქშენერს და აბრუნებს ქეიების ტუპლს და ვალუების ტუპლს
4. გვაქვს ორი ლისტი. პირველში ჩაწერილია 5 სახელი, მეორეში 5 ნიშანი. პროგრამამ უნდა შექმნას დიქშენერი,
სადაც სახელები იქნება ქეი, ხოლო ნიშნები იქნება ვალიუ და თითოეულ სახელს უნდა შეესაბამებოდეს შესაბამისი ნიშანი.
4.1. მე-4 ამოცანა გააკეთეთ ფუნქციით, სადაც ფუნქცია პარამეტრების სახით მიიღებს ამ ორ ლისტს.
5. გვაქვს 20 ელემენტისგან შემდგარი რიცხვების დიქშენერი, პროგრამამ ყველა ლუწი ქეი უნდა ჩაწეროს ცალკე ლისტში,
ყველა კენტი ქეი უნდა ჩაწეროს ცალკე ლისტში, ყველა ლუწი ვალიუ უნდა ჩაწეროს ცალკე ლისტში,
ყველა კენტი ვალიუ უნდა ჩაწეროს ცალკე ლისტში.
5.1 იგივე ამოცანა გააკეთეთ ფუნქციით, სადაც პარამეტრის სახით გადავა დიქშენერი."""
