# ---------- GIORGI BERIDZE ----------
#Lesson 7 home tasks
# Task №1
"""1.გვაქვს ცარიელი დიქშენერი შევავსოთ 30 შემთხვევითი ელემენტით, 
კეიც და ველიუც უნდა იყოს შემთხვევითი
ყველა ლუწი ქეი უნდა გადავწეროთ ცალკე ლისტში
ყველა კენტი ქეი უნდა გადავწეროთ ცალკე ლისტში
ყველა ლუწი ველიუ უნდა გადავწეროთ ცალკე ლისტში
ყველა კენტი ველიუ უნდა გადავწეროთ ცალკე ლისტში
ეკრანზე გამოიტანოს დიქშენერი და ოთხივე ლისტი"""

print("------------------")

# Task №2
"""2. გვაქვს ცარიელი დიქშენერი
შევავსოთ 20 შემთხვევითი ელემენტით, კეიც და ველიუც უნდა იყოს შემთხვევითი
პროგრამამ გამოიტანოს ქიების საშუალო არითმეტიკული და ვალუების მინიმალური 
და მაქსიმალური მნიშვნელობები."""


print("------------------")

# Task №3 - bonus exercises 
"""შექმენით შემთხვევითი სიტყვა, რომლის სიგრძეც იქნება 7-ის ტოლი.
1.1 შექმენით შემთხვევითი სიტყვა, რომლის სიგრძეც იქნება 2-დან 7-მდე რენდომულად.
1.2 შექმენით შემთხვევითი სიტყვა, რომლის სიგრძეც იქნება 2-დან 7-მდე რენდომულად. 
თუ ამ სიტყვაში აღმოჩნდება სიმბოლო 'a' პროგრამამ დაბეჭდოს ეს სიტყვა, 
ხოლო თუ არ აღმოჩნდება, დაბეჭდოს 'კიდევ სცადეთ'. """

print("------------------")

"""2. შექმენით შემთხვევითი სიტყვა, რომლის სიგრძეც იქნება 2-დან 7-მდე რენდომულად. 
თუ ამ სიტყვაში აღმოჩნდება სიმბოლო 'a' ან 'e', პროგრამამ ჩაწეროს ეს სიტყვა ლისტში, 
შედეგად მივიღოთ 4 რენდომული სიტყვისგან შემდგარი ლისტი"""

