"""მეცხრე შევედრის ამოცანები:
1. გვაქვს ორი ლისტი, პირველში არის 5 სახელი, მეორეში 5 ნიშანი.
პროგრამამ უნდა შექმნას დიქშენერი, სადაც სახელებს შეესაბამება key,
 შესაბამისად ნიშნებ შეესაბამება value-ები, ეს დიქშენერი უნდ აჩაიწეროს ფაილში.
1.1. იგივე ამოცანა გააკეთეთ ფუნქციით, სადაც ფუნქცია პარამეტრებად მიიღებს ორივე ლისტს.
2. გვაქვს 20 ელემენტისგან შემდგარი რიცხვების დიქშენერი, პროგრამამ ყველა ლუწი ქეი
უნდა ჩაწეროს ცალკე ლისტში, ყველა კენტი ქეი უნდა ჩაწეროს ცალკე ლისტში,
ყველა ლუწი ვალიუ უნდა ჩაწეროს ცალკე ლისტში, ყველა კენტი ვალიუ უნდა ჩაწეროს ცალკე ლისტში.
 დიქშენერი და ოთხივე ლისტი უნდა ჩაიწეროს ფაილში.
2.1 იგივე ამოცანა გააკეთეთ ფუნქციით, სადაც დიქშენერი გადავა პარამეტრის სახით.
3. გვაქვს 20 ელემენტისგან შემდგარი რიცხვების დიქშენერი,
პროგრამამ ყველა ლუწი ქეი უნდა ჩაწეროს ცალკე ტუპლში,
ყველა კენტი ქეი უნდა ჩაწეროს ცალკე ლისტში,
ყველა ლუწი ვალიუ უნდა ჩაწეროს ცალკე ლისტში,
ყველა კენტი ვალიუ უნდა ჩაწეროს ცალკე ტუპლში.
ორივე ტუპლი უნდა ჩაიწეროს ფაილში.
3.1 იგივე ამოცანა გააკეთეთ ფუნქციით, სადაც დიქშენერი გადავა პარამეტრის სახით.
4. გვაქვს ლისტი, a=["giorgi", "pavle", "mamuka", "dachi","irakli","iago",
"natia", "nino","nika","tamazi" ]პროგრამამ უნდა გადაწეროს ამ ლისტის ელემენტები
დიქშენერში, კეის სახით, ხოლო ველიუები გმოიმუშავოს რენდომულად და მიანიჭოს ქულების
 სახით თითოეულ ელემენტს.
4.1 გავაკეთოტ იგივე ფუნქციით, სადაც პარამეტრად გადავცემთ ლისტს,
ხოლო ველიუებს გამოიმუშავებს ავტომატურად ფუნქციის შიგნით.
5. პროგრამამ მოგვთხოვოს სიტყვის შეყვანა ხუთჯერ და ჩაწეროს შეყვანილი სიტყვა ფაილში
5.1 გავაკეთოთ იგივე ფუნქციით"""